In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
from pydataset import data

Paper by: Hadley Wickham

https://vita.had.co.nz/papers/tidy-data.pdf

### Data cleaning:

tidy data != clean data


- outlier checking  
- date parsing
- missing value imputation etc.
- <ins>data tidying: structuring datasets to facilitate analysis.</ins>

### Data semantics: tidy data

- Value: every value belongs to a variable and an observation.
- Variable: a variable contains all values that measure the same underlying attribute (like height, temperature, duration) across units.
- Observation: an observation contains all values measured on the same unit (like a person, or a day, or a race) across attributes.

####  datasets for lesson and exercises:

- https://classroom.google.com/c/MzUxODYzODI3NTE5/m/MzUxODYzODI3Njg5/details

In [4]:
# lets look at this data:
treatments = pd.read_csv('../untidy-data/treatment.csv')
treatments

     Unnamed: 0  treatmenta  treatmentb  treatmentc
0    John Smith         NaN           2           0
1      Jane Doe        16.0          11           3
2  Mary Johnson         3.0           1           4

In [5]:
#rename columns
treatments.columns = ['name', 'a', 'b', 'c']
treatments

           name     a   b  c
0    John Smith   NaN   2  0
1      Jane Doe  16.0  11  3
2  Mary Johnson   3.0   1  4

What is an observation here?  
variables?  
values?

In [6]:
# restructure data using 'melt'

treatments = treatments.melt(id_vars=['name'], var_name='treatment', value_name='response')

In [7]:
treatments

           name treatment  response
0    John Smith         a       NaN
1      Jane Doe         a      16.0
2  Mary Johnson         a       3.0
3    John Smith         b       2.0
4      Jane Doe         b      11.0
5  Mary Johnson         b       1.0
6    John Smith         c       0.0
7      Jane Doe         c       3.0
8  Mary Johnson         c       4.0

### Tidy data : 
- Each variable forms a column.
- Each observation forms a row.
- Each cell has a single value.
- data is tabular, i.e. made up of rows and columns

In [ ]:
# Examples of tidy-data?

#### General Ideas  
- If the units are the same, maybe they should be in the same column.
- If one column has measurements of different units, it should be spread out  
- Should you be able to groupby some of the columns? combine them  
- Can I pass this data to seaborn?  

- Can we ask interesting questions and answer them with a groupby? i.e. generally we don't want to be taking row or column averages.

### How to deal with 'messy' data


##### Reshaping data:  
  
- Wide data --> Long data format (Melt)  
- Long data --> Wide Data format (pivot_table, unstack)

#### 1. Messy data: Column headers are values, not variable names.

In [ ]:
df = pd.read_csv('untidy-data/pew.csv')
df.head()

In [ ]:
# look at info
df.info()

In [ ]:
# Melt the data. Creates two new columns with deault name of 'variable' and 'value'

In [ ]:
# melt data and specify names of new columns

# df_tidy

#### pd.melt arguments
- id_vars = columns you want to keep (not melt)
- var_name = name of new column you created by melting columns
- value_name = column name for values

#### Another example: one variable stored across multiple columns

In [ ]:
billboard = pd.read_csv('untidy-data/billboard.csv', encoding= 'unicode_escape')

In [ ]:
billboard.head()

In [ ]:
# what is mean rating for each track?

In [ ]:
# melt the data

# billboard_melt

In [ ]:
# what is the mean rating (across all weeks) of each track?

#### 2. Messy data: Multiple variables are stored in one column.

In [8]:
df = pd.DataFrame({
    'name': ['Sally', 'Jane', 'Billy', 'Suzy'],
    'pet': ['dog: max', 'dog: buddy', 'cat: grizabella', 'hamster: fred']
})
df

    name              pet
0  Sally         dog: max
1   Jane       dog: buddy
2  Billy  cat: grizabella
3   Suzy    hamster: fred

In [11]:
# how to split the string
df[['species','name']] = df.pet.str.split(':', expand=True)

In [ ]:
# how to split a pandas column/series

In [ ]:
# Another (better) way

In [ ]:
# create two new columns

In [ ]:
df.head()

#### Messy data: Variables are stored in both rows and columns

In [13]:
weather = pd.read_csv('../untidy-data/weather.csv')

weather.head()

,id,year,month,element,d1,d2,d3,d4,d5,d6,...,d22,d23,d24,d25,d26,d27,d28,d29,d30,d31
0,MX17004,2010,1,tmax,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,27.8,NaN
1,MX17004,2010,1,tmin,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,14.5,NaN
2,MX17004,2010,2,tmax,NaN,27.3,24.1,NaN,NaN,NaN,...,NaN,29.9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,MX17004,2010,2,tmin,NaN,14.4,14.4,NaN,NaN,NaN,...,NaN,10.7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,MX17004,2010,3,tmax,NaN,NaN,NaN,NaN,32.1,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
# how many rows and columns?
weather.shape

(22, 35)

In [16]:
weather.columns[:4]

Index(['id', 'year', 'month', 'element'], dtype='object')

In [19]:
# melt the 'days'

weather_long = weather.melt(id_vars= weather.columns[:4],
                            var_name= 'day', 
                            value_name='temp')
weather_long.head()

        id  year  month element day  temp
0  MX17004  2010      1    tmax  d1   NaN
1  MX17004  2010      1    tmin  d1   NaN
2  MX17004  2010      2    tmax  d1   NaN
3  MX17004  2010      2    tmin  d1   NaN
4  MX17004  2010      3    tmax  d1   NaN

In [18]:
weather_long.shape

(682, 6)

In [25]:
# pivot the element column. Reset index to go from multi-index to flat dataframe.

weather_tidy = weather_long.pivot_table(index= ['id','year','month','day'],
                                    columns= 'element',
                                    values= 'temp',
                                    aggfunc= 'mean').reset_index()

weather_tidy.head()

element       id  year  month  day  tmax  tmin
0        MX17004  2010      1  d30  27.8  14.5
1        MX17004  2010      2  d11  29.7  13.4
2        MX17004  2010      2   d2  27.3  14.4
3        MX17004  2010      2  d23  29.9  10.7
4        MX17004  2010      2   d3  24.1  14.4

#### pd.pivot_table arguments
- Index = columns you want to keep (not pivot)
- columns = column you want to pivot
- values = values we want to populate in the new columns
- aggfunct = how you want to aggregate the duplicate rows

## Mini Exercise:

- read in excel file named dem_score.xls
- convert the data in tidy format (hint: melt the data)
- convert the melted dataframe back in wide-format (hint: pivot the data)

In [26]:
# read in the excel file named dem_score.xlsx
df = pd.read_excel('../untidy-data/dem_score.xlsx')
df.head()

     country  1952  1957  1962  1967  1972  1977  1982  1987  1992
0    Albania    -9    -9    -9    -9    -9    -9    -9    -9     5
1  Argentina    -9    -1    -1    -9    -9    -9    -8     8     7
2    Armenia    -9    -7    -7    -7    -7    -7    -7    -7     7
3  Australia    10    10    10    10    10    10    10    10    10
4    Austria    10    10    10    10    10    10    10    10    10

In [29]:
# is the data in tidy format? What is the shape of data

df.shape

(96, 10)

In [30]:
# convert dataframe in 'tidy' format (hint: pd.melt)

df_tidy = df.melt(id_vars='country', var_name='year', value_name='dem_score')
df_tidy.head()

     country  year  dem_score
0    Albania  1952         -9
1  Argentina  1952         -9
2    Armenia  1952         -9
3  Australia  1952         10
4    Austria  1952         10

In [31]:
# check shape of tidy dataframe
df_tidy.shape

(864, 3)

In [34]:
# convert the data back in wide format (hint: pivot_table)
df_pivot = df_tidy.pivot_table(index='country',
                                columns='year',
                                values='dem_score').reset_index()

df_pivot.head()

year    country  1952  1957  1962  1967  1972  1977  1982  1987  1992
0       Albania    -9    -9    -9    -9    -9    -9    -9    -9     5
1     Argentina    -9    -1    -1    -9    -9    -9    -8     8     7
2       Armenia    -9    -7    -7    -7    -7    -7    -7    -7     7
3     Australia    10    10    10    10    10    10    10    10    10
4       Austria    10    10    10    10    10    10    10    10    10

#### Bit more complex example

In [36]:
sales = pd.read_csv('../untidy-data/sales.csv')

In [37]:
#check head
sales.head()

  Product  2016 Sales  2016 PPU  2017 Sales  2017 PPU  2018 Sales  2018 PPU
0       A         673         5         231         7         173         9
1       B         259         3         748         5         186         8
2       C         644         3         863         5         632         5
3       D         508         9         356        11         347        14

In [38]:
#check the shape
sales.shape

(4, 7)

In [40]:
# first we melt all the columns expect 'Product'

sales_melt = sales.melt(id_vars='Product')
sales_melt.head()

  Product    variable  value
0       A  2016 Sales    673
1       B  2016 Sales    259
2       C  2016 Sales    644
3       D  2016 Sales    508
4       A    2016 PPU      5

In [41]:
# shape of melted dataset
sales_melt.shape

(24, 3)

In [44]:
# here we split the 'variable' column to create two new columns 'year' and 'measure'
sales_melt[['year','measure']] = sales_melt.variable.str.split(' ', expand=True)
sales_melt.head()

  Product    variable  value  year measure
0       A  2016 Sales    673  2016   Sales
1       B  2016 Sales    259  2016   Sales
2       C  2016 Sales    644  2016   Sales
3       D  2016 Sales    508  2016   Sales
4       A    2016 PPU      5  2016     PPU

In [45]:
# now we will pivot the 'measure' column to create the two new columns 'PPU' and 'Sales'
# reset the index to flatten the dataframe 

sales_tidy = sales_melt.pivot_table(index = ['Product', 'year'],
                                        columns= 'measure',
                                        values= 'value',
                                        aggfunc='mean').reset_index()


sales_tidy.head()

measure Product  year  PPU  Sales
0             A  2016    5    673
1             A  2017    7    231
2             A  2018    9    173
3             B  2016    3    259
4             B  2017    5    748